Revit 2026 API

# SolidglassBumpEnableType Enumeration

---

The enumerated type representing the permitted values for the asset property "SolidglassBumpEnable" from the "SolidGlass" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SolidglassBumpEnableType
```
```vb
Public Enumeration SolidglassBumpEnableType
```
```cpp
public enum class SolidglassBumpEnableType
```
```fsharp
type SolidglassBumpEnableType
```

| Member name | Value | Description |
| --- | --- | --- |
| Custom | 3 |  |
| None | 0 |  |
| Rippled | 1 |  |
| Wavy | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace